FedorChervyakov/ceaa-nutrient-solution/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN FREERTOS_WRAPPER_FUNCTIONS */
static void APP_THREAD_JoinerProcess(void *argument)
{
  UNUSED(argument);
  otError error;

  osThreadFlagsClear( JOIN_TASK_FLAG_BEGIN );
  for(;;)
  {

      uint32_t t_flags = 0;
      osThreadFlagsWait(JOIN_TASK_FLAG_BEGIN, osFlagsWaitAll, osWaitForever);

      LED_Red(OFF);

      if (otIp6IsEnabled(NULL))
      {
        otIp6SetEnabled(NULL, false);
      }

      error = otInstanceErasePersistentInfo(NULL);
      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
      }

      otInstanceFinalize(NULL);

      otInstanceInitSingle();
      error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
      }

      LED_Blue(FAST_TOGGLING);

      error = otIp6SetEnabled(NULL, true);
      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
      }

      /* Start the joiner */
      error = otJoinerStart(NULL,
          C_PASSWORD,
          NULL,
          "OT", /* PACKAGE_NAME */
          "TestAppli",/* OPENTHREAD_CONFIG_PLATFORM_INFO */
          "NA", /* PACKAGE_VERSION */
          NULL, APP_THREAD_JoinerHandler, NULL);

      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_JOINER_START, error);
      }
          
      osThreadFlagsClear( JOIN_TASK_FLAG_BEGIN );
  }
}

/* USER CODE END FREERTOS_WRAPPER_FUNCTIONS */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/**
 * @brief Dummy request handler
 * @param
 * @retval None
 */
static void APP_THREAD_JoinerHandler(otError OtError, void *pContext)
{
  otError error;
  otJoinerState joiner_state;
  SHCI_CmdStatus_t shci_status;

  if (OtError == OT_ERROR_NONE)
  {
    error = otThreadSetEnabled(NULL, true);
    if (error != OT_ERROR_NONE)
    {
        APP_THREAD_Error(ERR_THREAD_START, error);
    }
    
    LED_Blue(SLOW_TOGGLING);

    osDelay(20000);

//    joiner_state = otJoinerGetState(NULL);
//    if (joiner_state != OT_JOINER_STATE_JOINED)
//    {
//        HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_SET);
//    }
    error = otThreadSetEnabled(NULL, false);

    if (error != OT_ERROR_NONE)
    {
        APP_THREAD_Error(ERR_THREAD_DISABLE, error);
    }
    
    if (otIp6IsEnabled(NULL))
    {
        error = otIp6SetEnabled(NULL, false);
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_DISABLE, error);
        }
    }

    otInstanceFinalize(NULL);

    shci_status = SHCI_C2_FLASH_StoreData(THREAD_IP);
    if (shci_status != SHCI_Success)
    {
        APP_THREAD_Error(ERR_THREAD_STORE_DATA, shci_status);
    }

    osDelay(1000);
    APP_THREAD_DeviceConfig();

  }
  else
  {
      APP_THREAD_Error(ERR_THREAD_JOINER_CB, OtError);
  }

  LED_Blue(OFF);
}

/**
 * @brief This function is used to handle the pH requests
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_ph_ReqHandler(otCoapHeader   * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_ph_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
            if (APP_THREAD_MethodNotAllowed_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
    } 
    while (false);
}

/**
 * @brief This function is used to send the pH response
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_ph_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;
    float ph = 0;
    char  str_ptr[10];
    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }
        
        ph = getpH();
        gcvt(ph, 5, str_ptr);

        error = otMessageAppend(pOT_Message, (void *) str_ptr, sizeof(char)*strlen(str_ptr));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}

/**
 * @brief This function is used to handle the EC requests
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_ec_ReqHandler(otCoapHeader   * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_ec_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
            if (APP_THREAD_MethodNotAllowed_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
    } 
    while (false);
}

/**
 * @brief This function is used to send the EC response
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_ec_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;
    float ec = 0;
    char  str_ptr[10];
    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }
        
        ec = getEC();
        gcvt(ec, 5, str_ptr);

        error = otMessageAppend(pOT_Message, (void *) str_ptr, sizeof(char)*strlen(str_ptr));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}

/**
 * @brief This function is used to handle the temperature requests
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_temp_ReqHandler(otCoapHeader   * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_temp_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
            if (APP_THREAD_MethodNotAllowed_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
    } 
    while (false);
}

/**
 * @brief This function is used to send the temperature response
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_temp_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;
    float temp = 0;
    char str_ptr[10];
    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }
        
        temp = getTemperature();
        gcvt(temp, 5, str_ptr);

        error = otMessageAppend(pOT_Message, (void *) str_ptr, sizeof(char)*strlen(str_ptr));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}

/**
 * @brief This function is used to send MethodNotAllowed response
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_MethodNotAllowed_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;

    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT,
                            OT_COAP_CODE_METHOD_NOT_ALLOWED);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}
/**
  * @brief Dummy request handler
  * @param
  * @retval None
  */
static void APP_THREAD_DummyReqHandler(void    * p_context,
                           otCoapHeader        * pHeader,
                           otMessage           * pMessage,
                           const otMessageInfo * pMessageInfo)
{
}

/**
 * @brief This function is used to handle a dummy response handler
 *
 * @param p_context  context
 * @param pHeader  coap header
 * @param pMessage message
 * @paramp pMessageInfo otMessage information
 * @param Result error status
 * @retval None
 */
static void APP_THREAD_DummyRespHandler(void    * p_context,
                            otCoapHeader        * pHeader,
                            otMessage           * pMessage,
                            const otMessageInfo * pMessageInfo,
                            otError             Result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(p_context);
  UNUSED(pHeader);
  UNUSED(pMessage);
  UNUSED(pMessageInfo);
  UNUSED(Result);
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

